<a href="https://colab.research.google.com/github/pokeychip19946/python-basics/blob/master/Day_2_1_Data_Manipulation_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1. Series
*   Kind of an array that have index attached to it.
*   It can hold data like list, array, tuples and dictionary.
*   It provide a sequence to the data.

2. DataFrame
*   Tabular kind of a data.
*   It has one or more than one series. Each series is consided as a single column of the data

In [ ]:
import pandas as pd

In [ ]:
### Create a series
marks = [100,90,30,45,80]
s1 = pd.Series(marks)
s1

In [ ]:
marks = [100,90,30,45,80]
sub = ["Maths","Science","Hindi","English","SST"]
s1 = pd.Series(marks,index=sub)
s1

In [ ]:
marks = (100,90,30,45,80)
sub = ("Maths","Science","Hindi","English","SST")
s1 = pd.Series(marks,index=sub)
s1

In [ ]:
dict = {"Maths":90,"Science":70,"Hindi":90,"Urdu":70,"SST":60,"Drawing":100}
s2 = pd.Series(dict)
s2

In [ ]:
s3 = s1 + s2
s3

In [ ]:
s3.head()   ## print first 5 rows of data

In [ ]:
s3.head(3)   ## print first 3 rows of data

In [ ]:
s3.tail()   ## print last 5 rows of data

In [ ]:
### Sorting of series
s3.sort_values()    ## ascending order

In [ ]:
### Sorting of series
s3.sort_values(ascending=False)    ## descending order

In [ ]:
### Sorting of series
s3.sort_values(ascending=False,na_position="first")    ## descending order

Drawing      NaN
English      NaN
Urdu         NaN
Maths      190.0
Science    160.0
SST        140.0
Hindi      120.0
dtype: float64

In [ ]:
### Picking the value
s3[3]

190.0

In [ ]:
s3['Maths']

190.0

In [ ]:
s3.iloc[3]

In [ ]:
s3.loc["Maths"]

190.0

In [ ]:
s3[3:5]

Maths    190.0
SST      140.0
dtype: float64

In [ ]:
s3.iloc[3:5]

Maths    190.0
SST      140.0
dtype: float64

In [ ]:
s3[:]

Drawing      NaN
English      NaN
Hindi      120.0
Maths      190.0
SST        140.0
Science    160.0
Urdu         NaN
dtype: float64

In [ ]:
#### Creating DataFrame
df = pd.DataFrame(s3)
df

In [ ]:
df = df.reset_index()
df

     index      0
0  Drawing    NaN
1  English    NaN
2    Hindi  120.0
3    Maths  190.0
4      SST  140.0
5  Science  160.0
6     Urdu    NaN

In [ ]:
# df = df.rename(columns={"index":"Subjects",0:"Marks"})
df.rename(columns={"index":"Subjects",0:"Marks"},inplace=True)

In [ ]:
df['School Name'] = "Delhi Public School - Gurgaon"
df

In [ ]:
sub = ["Mr.A","Mr.B","Mrs.C","Mrs.D","Miss E","Miss F","Mr.X"]
df["Teacher's Name"] = sub
df

  Subjects  Marks                    School Name Teacher's Name
0  Drawing    NaN  Delhi Public School - Gurgaon           Mr.A
1  English    NaN  Delhi Public School - Gurgaon           Mr.B
2    Hindi  120.0  Delhi Public School - Gurgaon          Mrs.C
3    Maths  190.0  Delhi Public School - Gurgaon          Mrs.D
4      SST  140.0  Delhi Public School - Gurgaon         Miss E
5  Science  160.0  Delhi Public School - Gurgaon         Miss F
6     Urdu    NaN  Delhi Public School - Gurgaon           Mr.X

In [ ]:
### to remove nan values
## df.dropna()

In [ ]:
df[['Marks']]

In [ ]:
df[['Marks',"School Name"]]

In [ ]:
mean_marks = df['Marks'].mean()
mean_marks

152.5

In [ ]:
df['Marks'].fillna(mean_marks,inplace=True)
df

  Subjects  Marks                    School Name Teacher's Name
0  Drawing  152.5  Delhi Public School - Gurgaon           Mr.A
1  English  152.5  Delhi Public School - Gurgaon           Mr.B
2    Hindi  120.0  Delhi Public School - Gurgaon          Mrs.C
3    Maths  190.0  Delhi Public School - Gurgaon          Mrs.D
4      SST  140.0  Delhi Public School - Gurgaon         Miss E
5  Science  160.0  Delhi Public School - Gurgaon         Miss F
6     Urdu  152.5  Delhi Public School - Gurgaon           Mr.X

In [ ]:
df.iloc[0]["Marks"]

152.5

In [ ]:
grade = []
for i in range(len(df)):
  marks = df.iloc[i]["Marks"]
  if marks>=150:
    grade.append("A")
  else:
    grade.append("B")

In [ ]:
df['Grade'] = grade
df

In [ ]:
### Sort Data By Marks
df.sort_values("Marks",ascending=False,inplace=True)
df

In [ ]:
df.reset_index(inplace=True)

In [ ]:
df

   index Subjects  Marks                    School Name Teacher's Name Grade
0      3    Maths  190.0  Delhi Public School - Gurgaon          Mrs.D     A
1      5  Science  160.0  Delhi Public School - Gurgaon         Miss F     A
2      0  Drawing  152.5  Delhi Public School - Gurgaon           Mr.A     A
3      1  English  152.5  Delhi Public School - Gurgaon           Mr.B     A
4      6     Urdu  152.5  Delhi Public School - Gurgaon           Mr.X     A
5      4      SST  140.0  Delhi Public School - Gurgaon         Miss E     B
6      2    Hindi  120.0  Delhi Public School - Gurgaon          Mrs.C     B

In [ ]:
#### Delete the column
df.drop(["index"],axis=1,inplace=True)
df

In [ ]:
#### Delete the row
df.drop([6],axis=0,inplace=True)
df

  Subjects  Marks                    School Name Teacher's Name Grade
0    Maths  190.0  Delhi Public School - Gurgaon          Mrs.D     A
1  Science  160.0  Delhi Public School - Gurgaon         Miss F     A
2  Drawing  152.5  Delhi Public School - Gurgaon           Mr.A     A
3  English  152.5  Delhi Public School - Gurgaon           Mr.B     A
4     Urdu  152.5  Delhi Public School - Gurgaon           Mr.X     A
5      SST  140.0  Delhi Public School - Gurgaon         Miss E     B

In [ ]:
## change the sequence of the column
cols = ["Subjects","Marks","Grade","Teacher's Name","School Name"]
df = df.reindex(columns=cols)
df

  Subjects  Marks Grade Teacher's Name                    School Name
0    Maths  190.0     A          Mrs.D  Delhi Public School - Gurgaon
1  Science  160.0     A         Miss F  Delhi Public School - Gurgaon
2  Drawing  152.5     A           Mr.A  Delhi Public School - Gurgaon
3  English  152.5     A           Mr.B  Delhi Public School - Gurgaon
4     Urdu  152.5     A           Mr.X  Delhi Public School - Gurgaon
5      SST  140.0     B         Miss E  Delhi Public School - Gurgaon

In [ ]:
df[df['Grade']=="A"]

In [ ]:
df[df['Marks']>150]

  Subjects  Marks Grade Teacher's Name                    School Name
0    Maths  190.0     A          Mrs.D  Delhi Public School - Gurgaon
1  Science  160.0     A         Miss F  Delhi Public School - Gurgaon
2  Drawing  152.5     A           Mr.A  Delhi Public School - Gurgaon
3  English  152.5     A           Mr.B  Delhi Public School - Gurgaon
4     Urdu  152.5     A           Mr.X  Delhi Public School - Gurgaon

In [ ]:
df

  Subjects  Marks Grade Teacher's Name                    School Name
0    Maths  190.0     A          Mrs.D  Delhi Public School - Gurgaon
1  Science  160.0     A         Miss F  Delhi Public School - Gurgaon
2  Drawing  152.5     A           Mr.A  Delhi Public School - Gurgaon
3  English  152.5     A           Mr.B  Delhi Public School - Gurgaon
4     Urdu  152.5     A           Mr.X  Delhi Public School - Gurgaon
5      SST  140.0     B         Miss E  Delhi Public School - Gurgaon

In [ ]:
df.insert(3,"Student Name","Umang Kejriwal",True)
df

  Subjects  Marks  ... Teacher's Name                    School Name
0    Maths  190.0  ...          Mrs.D  Delhi Public School - Gurgaon
1  Science  160.0  ...         Miss F  Delhi Public School - Gurgaon
2  Drawing  152.5  ...           Mr.A  Delhi Public School - Gurgaon
3  English  152.5  ...           Mr.B  Delhi Public School - Gurgaon
4     Urdu  152.5  ...           Mr.X  Delhi Public School - Gurgaon
5      SST  140.0  ...         Miss E  Delhi Public School - Gurgaon

[6 rows x 8 columns]

In [ ]:
df.drop(["Student Name"],axis=1,inplace=True)
df

  Subjects  Marks Grade Teacher's Name                    School Name
0    Maths  190.0     A          Mrs.D  Delhi Public School - Gurgaon
1  Science  160.0     A         Miss F  Delhi Public School - Gurgaon
2  Drawing  152.5     A           Mr.A  Delhi Public School - Gurgaon
3  English  152.5     A           Mr.B  Delhi Public School - Gurgaon
4     Urdu  152.5     A           Mr.X  Delhi Public School - Gurgaon
5      SST  140.0     B         Miss E  Delhi Public School - Gurgaon

In [ ]:
df1 = pd.DataFrame()
df1["Subjects"] = ["IT"]
df1["Marks"] = [200]
df1["Grade"] = ["A"]
df1["Teacher's Name"] = ["Mr.Y"]
df1["School Name"] = ["Delhi Public School - Gurgaon"]
df1

In [ ]:
df = df.append(df1)

In [ ]:
new_row = {"Subjects":"EVS","Marks":90,"Grade":"B",
           "Teacher's Name":"Mr.Z","School Name":"Delhi Public School - Gurgaon"}
df = df.append(new_row,ignore_index=True)

In [ ]:
df

  Subjects  Marks Grade Teacher's Name                    School Name
0    Maths  190.0     A          Mrs.D  Delhi Public School - Gurgaon
1  Science  160.0     A         Miss F  Delhi Public School - Gurgaon
2  Drawing  152.5     A           Mr.A  Delhi Public School - Gurgaon
3  English  152.5     A           Mr.B  Delhi Public School - Gurgaon
4     Urdu  152.5     A           Mr.X  Delhi Public School - Gurgaon
5      SST  140.0     B         Miss E  Delhi Public School - Gurgaon
6       IT  200.0     A           Mr.Y  Delhi Public School - Gurgaon
7      EVS   90.0     B           Mr.Z  Delhi Public School - Gurgaon

In [ ]:
### Export to CSV - Comma Seperated Value
df.to_csv("data.csv")